Revit 2027 API
RebarShapeDefinitionByArc(Document, RebarShapeDefinitionByArcType) Constructor
 Create a non-spiral shape definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeDefinitionByArc(
	Document doc,
	RebarShapeDefinitionByArcType type
)
Public Sub New (
	doc As Document,
	type As RebarShapeDefinitionByArcType
)
public:
RebarShapeDefinitionByArc(
	Document^ doc,
	RebarShapeDefinitionByArcType type
)
new :
        doc : Document *
        type : RebarShapeDefinitionByArcType -> RebarShapeDefinitionByArc
Parameters
doc Document
type RebarShapeDefinitionByArcType
Exceptions
Exception | Condition
ArgumentException |  The arc type cannot be set directly to Spiral. Instead, call SetArcTypeSpiral() to provide defaults for spiral parameters.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Replaces RebarShape.NewDefinitionByArc() from prior versions.
See Also
Reference
RebarShapeDefinitionByArc Class
RebarShapeDefinitionByArc Overload
Autodesk.Revit.DB.Structure Namespace